# Task #2
# Написати програму, яка буде пропонувати користувачу ввести певне число.
# У відповідь на введене число, програма має виводити в консоль задане число помножене на 256 та пропонувати ввести ще одне число.
# Наведена вище логіка має повторюватись безліч кількість разів.
# У випадку, якщо програма отримала число, яке містить у своєму записі більше ніж одну одиницю (1),
# потрібно вивести користувачу якесь довільне повідомлення про завершення виконання цієї програми та зупинити програму.
#
# Приклад взаємодії користувача з цією програмою:
# Введіть число:
# 1
# Результат виконання: 256
# Введіть число:
# 171
# Умови недотримані, зупиняю виконання програми.

until 
puts "Please enter any number:"
number = gets.chomp.to_i
result = number.to_s.chars.map(&:to_i)
	if  result.count(1) >= 2
		puts "Conditions were not met, the app has stopped."
		break
	end
multiplied = number * 256	
puts "Result: #{multiplied}"
end




